src/Reports/ОСВ/ОСВ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОСВ</name>
  <attributes>
    <name>НастройкаПериода</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/AccumulationRegisters/Касса/Касса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Касса</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Банк/Банк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Банк</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Покупатели/Покупатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Покупатели</name>
  <resources>
    <name>Сумма</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/Сообщения/Сообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сообщения</name>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/ОСВ/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция СформироватьОтчетНаСервере()
	
	Результат.Очистить();
	
	Макет = Отчеты.ОСВ.ПолучитьМакет("Макет_ОСВ");
	
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьКасса 	= Макет.ПолучитьОбласть("Касса");
	ОбластьБанк		= Макет.ПолучитьОбласть("Банк");
	ОбластьСчет		= Макет.ПолучитьОбласть("Счет");
	ОбластьСчет62	= Макет.ПолучитьОбласть("Счет62");
	//ОбластьСчет60	= Макет.ПолучитьОбласть("Счет60");
	ОбластьИтого		= Макет.ПолучитьОбласть("Итого");
	
	ОписаниеПериода = "" + ПредставлениеПериода(Отчет.НастройкаПериода.ДатаНачала, Отчет.НастройкаПериода.ДатаОкончания, "ФП = Истина");
	
	ОбластьШапка.Параметры.Период = ОписаниеПериода;
	
	Результат.Вывести(ОбластьШапка);

	Итог50нач	= 0;
	Итог50Дт	= 0;
	Итог50Кт	= 0;
	Итог50кон	= 0;
	
	// ---------------------------- Касса рубли ------------------------
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассаОстаткиИОбороты.СуммаНачальныйОстаток,
		|	КассаОстаткиИОбороты.СуммаКонечныйОстаток,
		|	КассаОстаткиИОбороты.СуммаПриход,
		|	КассаОстаткиИОбороты.СуммаРасход
		|ИЗ
		|	РегистрНакопления.Касса.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , Касса = &Касса) КАК КассаОстаткиИОбороты";

	Запрос.УстановитьПараметр("Касса", Справочники.Кассы.НайтиПоНаименованию("Касса (RUB)"));
	Запрос.УстановитьПараметр("ДатаНач", Отчет.НастройкаПериода.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", Отчет.НастройкаПериода.ДатаОкончания);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		
		Выборка.Следующий();
		
        //ОбластьКасса.Параметры.КассаРуб_СальдоНач	= Выборка.СуммаНачальныйОстаток;
        //ОбластьКасса.Параметры.КассаРуб_Дт			= Выборка.СуммаПриход;
        //ОбластьКасса.Параметры.КассаРуб_Кт			= Выборка.СуммаРасход;
        //ОбластьКасса.Параметры.КассаРуб_СальдоКон	= Выборка.СуммаКонечныйОстаток;
	
		Итог50нач	= Выборка.СуммаНачальныйОстаток;
		Итог50Дт	= Выборка.СуммаПриход;
		Итог50Кт	= Выборка.СуммаРасход;
		Итог50кон	= Выборка.СуммаКонечныйОстаток;
		
	КонецЕсли; 
    
    
    ОбластьКасса.Параметры.Итог50нач	= Итог50нач;
    ОбластьКасса.Параметры.Итог50Дт		= Итог50Дт;
    ОбластьКасса.Параметры.Итог50Кт		= Итог50Кт;
    ОбластьКасса.Параметры.Итог50кон	= Итог50кон;
    
    Результат.Вывести(ОбластьКасса);
	
	// ---------------------------- Банк ------------------------
		
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БанкОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
		|	БанкОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
		|	БанкОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
		|	БанкОстаткиИОбороты.СуммаРасход КАК СуммаРасход,
		|	БанкОстаткиИОбороты.Счет КАК Счет
		|ИЗ
		|	РегистрНакопления.Банк.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , ) КАК БанкОстаткиИОбороты
		|ГДЕ
		|	БанкОстаткиИОбороты.Счет.Активный
		|ИТОГИ
		|	СУММА(СуммаНачальныйОстаток),
		|	СУММА(СуммаКонечныйОстаток),
		|	СУММА(СуммаПриход),
		|	СУММА(СуммаРасход)
		|ПО
		|	ОБЩИЕ
		|АВТОУПОРЯДОЧИВАНИЕ";

	Запрос.УстановитьПараметр("ДатаНач", Отчет.НастройкаПериода.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", Отчет.НастройкаПериода.ДатаОкончания);
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ИтогоБанк = 0;

	Если ВыборкаИтоги.Количество() > 0 Тогда
		
		ВыборкаИтоги.Следующий();
		
		ОбластьБанк.Параметры.СальдоНач	= ВыборкаИтоги.СуммаНачальныйОстаток;
		ОбластьБанк.Параметры.Дт		= ВыборкаИтоги.СуммаПриход;
		ОбластьБанк.Параметры.Кт		= ВыборкаИтоги.СуммаРасход;
		ОбластьБанк.Параметры.СальдоКон	= ВыборкаИтоги.СуммаКонечныйОстаток;
	
		Результат.Вывести(ОбластьБанк);
		
		ИтогоБанк = ВыборкаИтоги.СуммаКонечныйОстаток;

	КонецЕсли;
	
	Выборка = ВыборкаИтоги.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСчет.Параметры.Счет			= Выборка.Счет;
		
		ОбластьСчет.Параметры.СальдоНач	= Выборка.СуммаНачальныйОстаток;
		ОбластьСчет.Параметры.Дт		= Выборка.СуммаПриход;
		ОбластьСчет.Параметры.Кт		= Выборка.СуммаРасход;
		ОбластьСчет.Параметры.СальдоКон	= Выборка.СуммаКонечныйОстаток;
	
		Результат.Вывести(ОбластьСчет);
		
	КонецЦикла; 
	
	// ---------------------------- Счет 62 ------------------------
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПокупателиОстаткиИОбороты.СуммаНачальныйОстаток,
		|	ПокупателиОстаткиИОбороты.СуммаКонечныйОстаток,
		|	ПокупателиОстаткиИОбороты.СуммаПриход,
		|	ПокупателиОстаткиИОбороты.СуммаРасход
		|ИЗ
		|	РегистрНакопления.Покупатели.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , ) КАК ПокупателиОстаткиИОбороты";

	Запрос.УстановитьПараметр("ДатаНач", Отчет.НастройкаПериода.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", Отчет.НастройкаПериода.ДатаОкончания);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		
		Выборка.Следующий();
		
		ОбластьСчет62.Параметры.СальдоНач	= Выборка.СуммаНачальныйОстаток;
		ОбластьСчет62.Параметры.Дт			= Выборка.СуммаПриход;
		ОбластьСчет62.Параметры.Кт			= Выборка.СуммаРасход;
		ОбластьСчет62.Параметры.СальдоКон	= Выборка.СуммаКонечныйОстаток;
	
	КонецЕсли; 
	
	Результат.Вывести(ОбластьСчет62);
	
	ОбластьИтого.Параметры.Сумма = Итог50кон + ИтогоБанк; 
	Результат.Вывести(ОбластьИтого);

	ОбластьСообщение = Макет.ПолучитьОбласть("Сообщение");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сообщения.Сообщение КАК Сообщение
		|ИЗ
		|	РегистрСведений.Сообщения КАК Сообщения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбластьСообщение.Параметры.Сообщение = Выборка.Сообщение; 
		Результат.Вывести(ОбластьСообщение);
	КонецЦикла;
	
	Результат.ТолькоПросмотр = Истина;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	РезультатВыполнения = СформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаКлиенте
Функция ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(ПолеТабличногоДокумента) Экспорт
	
	Сумма = 0;
	Для Каждого Область Из Результат.ВыделенныеОбласти Цикл
		Если ТипЗнч(Область) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Для ИндексСтрока = Область.Верх По Область.Низ Цикл
				Для ИндексКолонка = Область.Лево По Область.Право Цикл
					Попытка
						Сумма = Сумма + Число(СтрЗаменить(Результат.Область("R" + Формат(ИндексСтрока, "ЧГ=0") + "C" + Формат(ИндексКолонка, "ЧГ=0")) .Текст, " ", ""));
					Исключение
					КонецПопытки;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Сумма;
	
КонецФункции

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	
	ПолеСумма = ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.НастройкаПериода.Вариант =  ВариантСтандартногоПериода.ЭтотМесяц;

	РезультатВыполнения = СформироватьОтчетНаСервере();
	
КонецПроцедуры
